### Terraform Plan 📋
#### Format: `success`
#### Init: `success`
#### Validate: `success`
#### Plan: `success`

<details><summary>Show Plan</summary>

```
module.dns.data.cloudflare_zone.main: Reading...
module.dns.aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:us-east-1:260464233931:certificate/86e07f53-79c8-4ea1-85cb-892c06309921]
data.aws_availability_zones.available: Reading...
module.iam.aws_iam_role_policy_attachment.ssm: Refreshing state... [id=bank-onboarding-dev-ec2-role-20260207222151678600000002]
module.iam.aws_iam_role_policy_attachment.cloudwatch_agent: Refreshing state... [id=bank-onboarding-dev-ec2-role-20260207222151440300000001]
module.iam.aws_iam_role_policy_attachment.ecr_pull: Refreshing state... [id=bank-onboarding-dev-ec2-role-20260207222152145400000004]
module.iam.aws_iam_policy.ecr_pull: Refreshing state... [id=arn:aws:iam::260464233931:policy/bank-onboarding-dev-ecr-pull]
module.iam.aws_iam_policy.cloudwatch_logs: Refreshing state... [id=arn:aws:iam::260464233931:policy/bank-onboarding-dev-cloudwatch-logs]
module.iam.aws_iam_role_policy_attachment.cloudwatch_logs: Refreshing state... [id=bank-onboarding-dev-ec2-role-20260207222151732300000003]
module.compute.aws_iam_role_policy.scheduler: Refreshing state... [id=bank-onboarding-dev-ec2-scheduler:ec2-start-stop]
module.security.aws_vpc_security_group_egress_rule.ec2_all_out: Refreshing state... [id=sgr-06aed5bc5368778c4]
module.compute.aws_iam_role.scheduler: Refreshing state... [id=bank-onboarding-dev-ec2-scheduler]
module.compute.aws_scheduler_schedule.stop_ec2: Refreshing state... [id=default/bank-onboarding-dev-stop-ec2]
module.compute.aws_instance.backend: Refreshing state... [id=i-096e040090d289ef6]
module.compute.aws_scheduler_schedule.start_ec2: Refreshing state... [id=default/bank-onboarding-dev-start-ec2]
module.security.aws_vpc_security_group_egress_rule.vpc_link_to_ec2: Refreshing state... [id=sgr-049e4bfa007b04f43]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.security.aws_security_group.ec2: Refreshing state... [id=sg-0f22f517dc3d6cbe1]
module.monitoring.aws_cloudwatch_metric_alarm.status_check: Refreshing state... [id=bank-onboarding-dev-status-check]
module.dns.data.cloudflare_zone.main: Read complete after 1s [id=86bb9d0b6e1d94ff45a41f0ea11050c0]
module.monitoring.aws_sns_topic.alarms: Refreshing state... [id=arn:aws:sns:us-east-1:260464233931:bank-onboarding-dev-alarms]
module.security.aws_vpc_security_group_ingress_rule.ec2_from_vpc_link: Refreshing state... [id=sgr-0efd2556c42329b1b]
module.iam.aws_iam_role.ec2: Refreshing state... [id=bank-onboarding-dev-ec2-role]
module.monitoring.aws_cloudwatch_log_group.backend: Refreshing state... [id=/bank-onboarding-dev/backend]
module.api_gateway.aws_service_discovery_instance.backend: Refreshing state... [id=backend-ec2]
module.iam.aws_iam_instance_profile.ec2: Refreshing state... [id=bank-onboarding-dev-ec2-profile]
module.iam.data.aws_iam_policy_document.ecs_assume_role: Reading...
module.iam.data.aws_iam_policy_document.ecs_assume_role: Read complete after 0s [id=1077804475]
module.networking.aws_vpc.main: Refreshing state... [id=vpc-053ca2b76874e5fcc]
module.api_gateway.aws_apigatewayv2_api.main: Refreshing state... [id=efk4ptkz0m]
module.cdn.aws_cloudfront_origin_access_control.frontend: Refreshing state... [id=E1BK15JJE3YW2Q]
module.monitoring.aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=/bank-onboarding-dev/api-gateway]
module.ecr.aws_ecr_repository.backend: Refreshing state... [id=bank-onboarding-dev/backend]
module.api_gateway.aws_service_discovery_http_namespace.main: Refreshing state... [id=ns-qfxrgogwbc5s7rjb]
data.aws_caller_identity.current: Reading...
module.storage.aws_s3_bucket.frontend: Refreshing state... [id=bank-onboarding-dev-frontend]
data.aws_caller_identity.current: Read complete after 0s [id=260464233931]
module.dns.aws_acm_certificate_validation.main: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.dns.cloudflare_record.acm_validation["bank.juancamilofarfan.com"]: Refreshing state... [id=438312c84fd94b44b99a1637753863b4]
module.api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.ecr.aws_ecr_lifecycle_policy.backend: Refreshing state... [id=bank-onboarding-dev/backend]
module.api_gateway.aws_service_discovery_service.backend: Refreshing state... [id=srv-arwjv6y2ah4yombq]
module.storage.aws_s3_bucket_versioning.frontend: Refreshing state... [id=bank-onboarding-dev-frontend]
module.storage.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=bank-onboarding-dev-frontend]
module.cdn.aws_cloudfront_distribution.main: Refreshing state... [id=E5RYDWL2D0QXC]
module.cdn.aws_s3_bucket_policy.frontend: Refreshing state... [id=bank-onboarding-dev-frontend]
cloudflare_record.app: Refreshing state... [id=987974df206cd55d8d0e4d74a98d392f]
module.networking.aws_internet_gateway.main: Refreshing state... [id=igw-06597a6fe00670a42]
module.networking.aws_subnet.private[1]: Refreshing state... [id=subnet-0bf09a6ac934a3cb0]
module.networking.aws_subnet.public[0]: Refreshing state... [id=subnet-0117e29a8093779e9]
module.networking.aws_subnet.public[1]: Refreshing state... [id=subnet-005f84fbda9b2b4fe]
module.networking.aws_subnet.private[0]: Refreshing state... [id=subnet-09da0a4615c47961e]
module.security.aws_security_group.vpc_link: Refreshing state... [id=sg-0fdb8bc25de957951]
module.monitoring.aws_cloudwatch_metric_alarm.cpu_high: Refreshing state... [id=bank-onboarding-dev-cpu-high]
module.monitoring.aws_cloudwatch_metric_alarm.memory_high: Refreshing state... [id=bank-onboarding-dev-memory-high]
module.networking.aws_eip.nat: Refreshing state... [id=eipalloc-04baf96177d3eb864]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-045ad7c2da1aea55b]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-008061ca9ff058e1d]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0f0ebcac8afcc2c27]
module.security.aws_vpc_security_group_ingress_rule.vpc_link_inbound: Refreshing state... [id=sgr-08a331a5e318bb41c]
module.api_gateway.aws_apigatewayv2_vpc_link.main: Refreshing state... [id=pjk6nk]
module.networking.aws_nat_gateway.main: Refreshing state... [id=nat-08a982ba868a2b9fc]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-0270872c94bae4618]
module.api_gateway.aws_apigatewayv2_integration.backend: Refreshing state... [id=kaqbint]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-059d2b69771bda85d]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f513a1cca3e9e421]
module.api_gateway.aws_apigatewayv2_route.actuator: Refreshing state... [id=td9hdr3]
module.api_gateway.aws_apigatewayv2_route.api_proxy: Refreshing state... [id=rwq3qjv]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.api_gateway.aws_service_discovery_instance.backend will be destroyed
  # (because aws_service_discovery_instance.backend is not in configuration)
  - resource "aws_service_discovery_instance" "backend" {
      - attributes  = {
          - "AWS_INSTANCE_IPV4" = "10.0.10.242"
          - "AWS_INSTANCE_PORT" = "8080"
        } -> null
      - id          = "backend-ec2" -> null
      - instance_id = "backend-ec2" -> null
      - service_id  = "srv-arwjv6y2ah4yombq" -> null
    }

  # module.compute.aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "bank-onboarding-dev-cluster"
      + tags     = {
          + "Name" = "bank-onboarding-dev-cluster"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "bank-onboarding-dev-cluster"
          + "Project"     = "bank-onboarding"
        }

      + setting {
          + name  = "containerInsights"
          + value = "disabled"
        }
    }

  # module.compute.aws_ecs_service.backend will be created
  + resource "aws_ecs_service" "backend" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "bank-onboarding-dev-backend"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "bank-onboarding-dev-backend-service"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "bank-onboarding-dev-backend-service"
          + "Project"     = "bank-onboarding"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-09da0a4615c47961e",
              + "subnet-0bf09a6ac934a3cb0",
            ]
        }

      + service_registries {
          + registry_arn = "arn:aws:servicediscovery:us-east-1:260464233931:service/srv-arwjv6y2ah4yombq"
        }
    }

  # module.compute.aws_ecs_task_definition.backend will be created
  + resource "aws_ecs_task_definition" "backend" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "bank-onboarding-dev-backend"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name" = "bank-onboarding-dev-backend-task"
        }
      + tags_all                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "bank-onboarding-dev-backend-task"
          + "Project"     = "bank-onboarding"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.compute.aws_iam_role.scheduler will be destroyed
  # (because aws_iam_role.scheduler is not in configuration)
  - resource "aws_iam_role" "scheduler" {
      - arn                   = "arn:aws:iam::260464233931:role/bank-onboarding-dev-ec2-scheduler" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "scheduler.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2026-02-07T22:21:50Z" -> null
      - force_detach_policies = false -> null
      - id                    = "bank-onboarding-dev-ec2-scheduler" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "bank-onboarding-dev-ec2-scheduler" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Project"     = "bank-onboarding"
        } -> null
      - unique_id             = "AROATZJHAZXFY66I77ESK" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "ec2-start-stop" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "ec2:StartInstances",
                              - "ec2:StopInstances",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:ec2:us-east-1:260464233931:instance/i-0a7ad872eb4d0e8be"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.compute.aws_iam_role_policy.scheduler will be destroyed
  # (because aws_iam_role_policy.scheduler is not in configuration)
  - resource "aws_iam_role_policy" "scheduler" {
      - id          = "bank-onboarding-dev-ec2-scheduler:ec2-start-stop" -> null
      - name        = "ec2-start-stop" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ec2:StartInstances",
                          - "ec2:StopInstances",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ec2:us-east-1:260464233931:instance/i-096e040090d289ef6"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "bank-onboarding-dev-ec2-scheduler" -> null
        # (1 unchanged attribute hidden)
    }

  # module.compute.aws_instance.backend will be destroyed
  # (because aws_instance.backend is not in configuration)
  - resource "aws_instance" "backend" {
      - ami                                  = "ami-04fdc0a2bb4908035" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:260464233931:instance/i-096e040090d289ef6" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-east-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "bank-onboarding-dev-ec2-profile" -> null
      - id                                   = "i-096e040090d289ef6" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t3.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-0f02dbffba56545b1" -> null
      - private_dns                          = "ip-10-0-10-242.ec2.internal" -> null
      - private_ip                           = "10.0.10.242" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-09da0a4615c47961e" -> null
      - tags                                 = {
          - "Name" = "bank-onboarding-dev-backend"
        } -> null
      - tags_all                             = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Name"        = "bank-onboarding-dev-backend"
          - "Project"     = "bank-onboarding"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = (sensitive value) -> null
      - user_data_replace_on_change          = true -> null
      - vpc_security_group_ids               = [
          - "sg-0f22f517dc3d6cbe1",
        ] -> null
        # (9 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = true -> null
          - iops                  = 3000 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:260464233931:key/1f25814b-396c-4254-bfd7-8ac7436a153e" -> null
          - tags_all              = {
              - "Environment" = "dev"
              - "ManagedBy"   = "terraform"
              - "Project"     = "bank-onboarding"
            } -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0efd6274131364b1f" -> null
          - volume_size           = 30 -> null
          - volume_type           = "gp3" -> null
        }
    }

  # module.compute.aws_scheduler_schedule.start_ec2 will be destroyed
  # (because aws_scheduler_schedule.start_ec2 is not in configuration)
  - resource "aws_scheduler_schedule" "start_ec2" {
      - arn                          = "arn:aws:scheduler:us-east-1:260464233931:schedule/default/bank-onboarding-dev-start-ec2" -> null
      - group_name                   = "default" -> null
      - id                           = "default/bank-onboarding-dev-start-ec2" -> null
      - name                         = "bank-onboarding-dev-start-ec2" -> null
      - schedule_expression          = "cron(0 8 ? * MON-FRI *)" -> null
      - schedule_expression_timezone = "America/Bogota" -> null
      - state                        = "ENABLED" -> null
        # (5 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:ec2:startInstances" -> null
          - input    = jsonencode(
                {
                  - InstanceIds = [
                      - "i-096e040090d289ef6",
                    ]
                }
            ) -> null
          - role_arn = "arn:aws:iam::260464233931:role/bank-onboarding-dev-ec2-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.compute.aws_scheduler_schedule.stop_ec2 will be destroyed
  # (because aws_scheduler_schedule.stop_ec2 is not in configuration)
  - resource "aws_scheduler_schedule" "stop_ec2" {
      - arn                          = "arn:aws:scheduler:us-east-1:260464233931:schedule/default/bank-onboarding-dev-stop-ec2" -> null
      - group_name                   = "default" -> null
      - id                           = "default/bank-onboarding-dev-stop-ec2" -> null
      - name                         = "bank-onboarding-dev-stop-ec2" -> null
      - schedule_expression          = "cron(0 17 ? * MON-FRI *)" -> null
      - schedule_expression_timezone = "America/Bogota" -> null
      - state                        = "ENABLED" -> null
        # (5 unchanged attributes hidden)

      - flexible_time_window {
          - maximum_window_in_minutes = 0 -> null
          - mode                      = "OFF" -> null
        }

      - target {
          - arn      = "arn:aws:scheduler:::aws-sdk:ec2:stopInstances" -> null
          - input    = jsonencode(
                {
                  - InstanceIds = [
                      - "i-096e040090d289ef6",
                    ]
                }
            ) -> null
          - role_arn = "arn:aws:iam::260464233931:role/bank-onboarding-dev-ec2-scheduler" -> null

          - retry_policy {
              - maximum_event_age_in_seconds = 86400 -> null
              - maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.iam.aws_iam_instance_profile.ec2 will be destroyed
  # (because aws_iam_instance_profile.ec2 is not in configuration)
  - resource "aws_iam_instance_profile" "ec2" {
      - arn         = "arn:aws:iam::260464233931:instance-profile/bank-onboarding-dev-ec2-profile" -> null
      - create_date = "2026-02-07T22:21:51Z" -> null
      - id          = "bank-onboarding-dev-ec2-profile" -> null
      - name        = "bank-onboarding-dev-ec2-profile" -> null
      - path        = "/" -> null
      - role        = "bank-onboarding-dev-ec2-role" -> null
      - tags        = {} -> null
      - tags_all    = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Project"     = "bank-onboarding"
        } -> null
      - unique_id   = "AIPATZJHAZXFY3XEFBVYJ" -> null
        # (1 unchanged attribute hidden)
    }

  # module.iam.aws_iam_policy.cloudwatch_logs will be destroyed
  # (because aws_iam_policy.cloudwatch_logs is not in configuration)
  - resource "aws_iam_policy" "cloudwatch_logs" {
      - arn              = "arn:aws:iam::260464233931:policy/bank-onboarding-dev-cloudwatch-logs" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::260464233931:policy/bank-onboarding-dev-cloudwatch-logs" -> null
      - name             = "bank-onboarding-dev-cloudwatch-logs" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-east-1:260464233931:log-group:/bank-onboarding-dev/backend:*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPATZJHAZXF27TD6NUVP" -> null
      - tags             = {} -> null
      - tags_all         = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Project"     = "bank-onboarding"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.iam.aws_iam_policy.ecr_pull will be destroyed
  # (because aws_iam_policy.ecr_pull is not in configuration)
  - resource "aws_iam_policy" "ecr_pull" {
      - arn              = "arn:aws:iam::260464233931:policy/bank-onboarding-dev-ecr-pull" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::260464233931:policy/bank-onboarding-dev-ecr-pull" -> null
      - name             = "bank-onboarding-dev-ecr-pull" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:us-east-1:260464233931:repository/bank-onboarding-dev/backend"
                    },
                  - {
                      - Action   = "ecr:GetAuthorizationToken"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPATZJHAZXFRECNMUGPP" -> null
      - tags             = {} -> null
      - tags_all         = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Project"     = "bank-onboarding"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.iam.aws_iam_role.ec2 will be destroyed
  # (because aws_iam_role.ec2 is not in configuration)
  - resource "aws_iam_role" "ec2" {
      - arn                   = "arn:aws:iam::260464233931:role/bank-onboarding-dev-ec2-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2026-02-07T22:21:50Z" -> null
      - force_detach_policies = false -> null
      - id                    = "bank-onboarding-dev-ec2-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::260464233931:policy/bank-onboarding-dev-cloudwatch-logs",
          - "arn:aws:iam::260464233931:policy/bank-onboarding-dev-ecr-pull",
          - "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore",
          - "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "bank-onboarding-dev-ec2-role" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Name" = "bank-onboarding-dev-ec2-role"
        } -> null
      - tags_all              = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Name"        = "bank-onboarding-dev-ec2-role"
          - "Project"     = "bank-onboarding"
        } -> null
      - unique_id             = "AROATZJHAZXF6LTI5PKFV" -> null
        # (3 unchanged attributes hidden)
    }

  # module.iam.aws_iam_role.ecs_execution will be created
  + resource "aws_iam_role" "ecs_execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bank-onboarding-dev-ecs-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "bank-onboarding-dev-ecs-execution-role"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "bank-onboarding-dev-ecs-execution-role"
          + "Project"     = "bank-onboarding"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bank-onboarding-dev-ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "bank-onboarding-dev-ecs-task-role"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "bank-onboarding-dev-ecs-task-role"
          + "Project"     = "bank-onboarding"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.cloudwatch_agent will be destroyed
  # (because aws_iam_role_policy_attachment.cloudwatch_agent is not in configuration)
  - resource "aws_iam_role_policy_attachment" "cloudwatch_agent" {
      - id         = "bank-onboarding-dev-ec2-role-20260207222151440300000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy" -> null
      - role       = "bank-onboarding-dev-ec2-role" -> null
    }

  # module.iam.aws_iam_role_policy_attachment.cloudwatch_logs will be destroyed
  # (because aws_iam_role_policy_attachment.cloudwatch_logs is not in configuration)
  - resource "aws_iam_role_policy_attachment" "cloudwatch_logs" {
      - id         = "bank-onboarding-dev-ec2-role-20260207222151732300000003" -> null
      - policy_arn = "arn:aws:iam::260464233931:policy/bank-onboarding-dev-cloudwatch-logs" -> null
      - role       = "bank-onboarding-dev-ec2-role" -> null
    }

  # module.iam.aws_iam_role_policy_attachment.ecr_pull will be destroyed
  # (because aws_iam_role_policy_attachment.ecr_pull is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ecr_pull" {
      - id         = "bank-onboarding-dev-ec2-role-20260207222152145400000004" -> null
      - policy_arn = "arn:aws:iam::260464233931:policy/bank-onboarding-dev-ecr-pull" -> null
      - role       = "bank-onboarding-dev-ec2-role" -> null
    }

  # module.iam.aws_iam_role_policy_attachment.ecs_execution will be created
  + resource "aws_iam_role_policy_attachment" "ecs_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "bank-onboarding-dev-ecs-execution-role"
    }

  # module.iam.aws_iam_role_policy_attachment.ssm will be destroyed
  # (because aws_iam_role_policy_attachment.ssm is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ssm" {
      - id         = "bank-onboarding-dev-ec2-role-20260207222151678600000002" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore" -> null
      - role       = "bank-onboarding-dev-ec2-role" -> null
    }

  # module.monitoring.aws_cloudwatch_metric_alarm.cpu_high will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "cpu_high" {
      ~ alarm_description                     = "EC2 CPU usage above 80% for 10 minutes" -> "ECS CPU utilization above 80% for 10 minutes"
      ~ dimensions                            = {
          + "ClusterName" = "bank-onboarding-dev-cluster"
          - "InstanceId"  = "i-096e040090d289ef6" -> null
          + "ServiceName" = "bank-onboarding-dev-backend"
        }
        id                                    = "bank-onboarding-dev-cpu-high"
      ~ metric_name                           = "cpu_usage_active" -> "CPUUtilization"
      ~ namespace                             = "bank-onboarding-dev/CWAgent" -> "AWS/ECS"
        tags                                  = {
            "Name" = "bank-onboarding-dev-cpu-alarm"
        }
        # (18 unchanged attributes hidden)
    }

  # module.monitoring.aws_cloudwatch_metric_alarm.memory_high will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "memory_high" {
      ~ alarm_description                     = "EC2 memory usage above 85% for 10 minutes" -> "ECS memory utilization above 85% for 10 minutes"
      ~ dimensions                            = {
          + "ClusterName" = "bank-onboarding-dev-cluster"
          - "InstanceId"  = "i-096e040090d289ef6" -> null
          + "ServiceName" = "bank-onboarding-dev-backend"
        }
        id                                    = "bank-onboarding-dev-memory-high"
      ~ metric_name                           = "mem_used_percent" -> "MemoryUtilization"
      ~ namespace                             = "bank-onboarding-dev/CWAgent" -> "AWS/ECS"
        tags                                  = {
            "Name" = "bank-onboarding-dev-memory-alarm"
        }
        # (18 unchanged attributes hidden)
    }

  # module.monitoring.aws_cloudwatch_metric_alarm.status_check will be destroyed
  # (because aws_cloudwatch_metric_alarm.status_check is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "status_check" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:us-east-1:260464233931:bank-onboarding-dev-alarms",
        ] -> null
      - alarm_description                     = "EC2 instance status check failed" -> null
      - alarm_name                            = "bank-onboarding-dev-status-check" -> null
      - arn                                   = "arn:aws:cloudwatch:us-east-1:260464233931:alarm:bank-onboarding-dev-status-check" -> null
      - comparison_operator                   = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {
          - "InstanceId" = "i-096e040090d289ef6"
        } -> null
      - evaluation_periods                    = 2 -> null
      - id                                    = "bank-onboarding-dev-status-check" -> null
      - insufficient_data_actions             = [] -> null
      - metric_name                           = "StatusCheckFailed" -> null
      - namespace                             = "AWS/EC2" -> null
      - ok_actions                            = [] -> null
      - period                                = 60 -> null
      - statistic                             = "Maximum" -> null
      - tags                                  = {
          - "Name" = "bank-onboarding-dev-status-alarm"
        } -> null
      - tags_all                              = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Name"        = "bank-onboarding-dev-status-alarm"
          - "Project"     = "bank-onboarding"
        } -> null
      - threshold                             = 1 -> null
      - treat_missing_data                    = "missing" -> null
        # (4 unchanged attributes hidden)
    }

  # module.security.aws_security_group.ec2 will be destroyed
  # (because aws_security_group.ec2 is not in configuration)
  - resource "aws_security_group" "ec2" {
      - arn                    = "arn:aws:ec2:us-east-1:260464233931:security-group/sg-0f22f517dc3d6cbe1" -> null
      - description            = "Security group for backend EC2 instance" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - id                     = "sg-0f22f517dc3d6cbe1" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0fdb8bc25de957951",
                ]
              - self             = false
              - to_port          = 8080
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - name                   = "bank-onboarding-dev-ec2-sg" -> null
      - owner_id               = "260464233931" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "bank-onboarding-dev-ec2-sg"
        } -> null
      - tags_all               = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Name"        = "bank-onboarding-dev-ec2-sg"
          - "Project"     = "bank-onboarding"
        } -> null
      - vpc_id                 = "vpc-053ca2b76874e5fcc" -> null
        # (1 unchanged attribute hidden)
    }

  # module.security.aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "Security group for backend ECS tasks"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "bank-onboarding-dev-ecs-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "bank-onboarding-dev-ecs-sg"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "bank-onboarding-dev-ecs-sg"
          + "Project"     = "bank-onboarding"
        }
      + vpc_id                 = "vpc-053ca2b76874e5fcc"
    }

  # module.security.aws_vpc_security_group_egress_rule.ec2_all_out will be destroyed
  # (because aws_vpc_security_group_egress_rule.ec2_all_out is not in configuration)
  - resource "aws_vpc_security_group_egress_rule" "ec2_all_out" {
      - arn                    = "arn:aws:ec2:us-east-1:260464233931:security-group-rule/sgr-06aed5bc5368778c4" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - id                     = "sgr-06aed5bc5368778c4" -> null
      - ip_protocol            = "-1" -> null
      - security_group_id      = "sg-0f22f517dc3d6cbe1" -> null
      - security_group_rule_id = "sgr-06aed5bc5368778c4" -> null
      - tags_all               = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Project"     = "bank-onboarding"
        } -> null
    }

  # module.security.aws_vpc_security_group_egress_rule.ecs_all_out will be created
  + resource "aws_vpc_security_group_egress_rule" "ecs_all_out" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "bank-onboarding"
        }
    }

  # module.security.aws_vpc_security_group_egress_rule.vpc_link_to_ec2 will be destroyed
  # (because aws_vpc_security_group_egress_rule.vpc_link_to_ec2 is not in configuration)
  - resource "aws_vpc_security_group_egress_rule" "vpc_link_to_ec2" {
      - arn                          = "arn:aws:ec2:us-east-1:260464233931:security-group-rule/sgr-049e4bfa007b04f43" -> null
      - from_port                    = 8080 -> null
      - id                           = "sgr-049e4bfa007b04f43" -> null
      - ip_protocol                  = "tcp" -> null
      - referenced_security_group_id = "sg-0f22f517dc3d6cbe1" -> null
      - security_group_id            = "sg-0fdb8bc25de957951" -> null
      - security_group_rule_id       = "sgr-049e4bfa007b04f43" -> null
      - tags_all                     = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Project"     = "bank-onboarding"
        } -> null
      - to_port                      = 8080 -> null
    }

  # module.security.aws_vpc_security_group_egress_rule.vpc_link_to_ecs will be created
  + resource "aws_vpc_security_group_egress_rule" "vpc_link_to_ecs" {
      + arn                          = (known after apply)
      + from_port                    = 8080
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = "sg-0fdb8bc25de957951"
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "bank-onboarding"
        }
      + to_port                      = 8080
    }

  # module.security.aws_vpc_security_group_ingress_rule.ec2_from_vpc_link will be destroyed
  # (because aws_vpc_security_group_ingress_rule.ec2_from_vpc_link is not in configuration)
  - resource "aws_vpc_security_group_ingress_rule" "ec2_from_vpc_link" {
      - arn                          = "arn:aws:ec2:us-east-1:260464233931:security-group-rule/sgr-0efd2556c42329b1b" -> null
      - from_port                    = 8080 -> null
      - id                           = "sgr-0efd2556c42329b1b" -> null
      - ip_protocol                  = "tcp" -> null
      - referenced_security_group_id = "sg-0fdb8bc25de957951" -> null
      - security_group_id            = "sg-0f22f517dc3d6cbe1" -> null
      - security_group_rule_id       = "sgr-0efd2556c42329b1b" -> null
      - tags_all                     = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Project"     = "bank-onboarding"
        } -> null
      - to_port                      = 8080 -> null
    }

  # module.security.aws_vpc_security_group_ingress_rule.ecs_from_vpc_link will be created
  + resource "aws_vpc_security_group_ingress_rule" "ecs_from_vpc_link" {
      + arn                          = (known after apply)
      + from_port                    = 8080
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = "sg-0fdb8bc25de957951"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "bank-onboarding"
        }
      + to_port                      = 8080
    }

Plan: 10 to add, 2 to change, 19 to destroy.

Changes to Outputs:
  - ec2_instance_id            = "i-096e040090d289ef6" -> null
  + ecs_cluster_name           = "bank-onboarding-dev-cluster"
  + ecs_service_name           = "bank-onboarding-dev-backend"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @juancadev-io, Action: `pull_request`*